Revit 2027 API
BuiltInFailures.SlabShapeFailures.SlabShapeCannotPasteSubpicksInOtherDoc Property
 Cannot paste points or lines into another project. Paste points or lines into the original project only.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SlabShapeCannotPasteSubpicksInOtherDoc { get; }
Public Shared ReadOnly Property SlabShapeCannotPasteSubpicksInOtherDoc As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SlabShapeCannotPasteSubpicksInOtherDoc {
	FailureDefinitionId^ get ();
}
static member SlabShapeCannotPasteSubpicksInOtherDoc : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SlabShapeFailures Class
Autodesk.Revit.DB Namespace